Jackie7-Deng/Deepcraft-PSoC-Edge-ML-Assitant-for-CAE/PSOC_Edge_Machine_Learning_Face_ID_Demo/proj_cm55/main.c
/*******************************************************************************
* File Name        : main.c
*
* Description      : This source file contains the main routine for CM55 CPU
*
* Related Document : See README.md
*
********************************************************************************
* (c) 2023-2025, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
* 
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/

/*******************************************************************************
* Header Files
*******************************************************************************/
#include <stdint.h>
#include "cybsp.h"
#include "retarget_io_init.h"
#include "FreeRTOS.h"
#include "task.h"
#include "cycfg_qspi_memslot.h"
#include "mtb_serial_memory.h"
#include "cy_time.h"
#include "ifx_time_utils.h"
#include "ifx_face_id.h"
#include "oob_uart_cmd.h"
#include "cy_scb_uart.h"

/*******************************************************************************
* Macros
*******************************************************************************/

/* The timeout value in microsecond used to wait for core to be booted */
#define CM55_BOOT_WAIT_TIME_USEC            (10U)
#define LED_TOGGLE_DELAY_MSEC               (1000u)  /* LED blink delay */
#define SMIF_INIT_TIMEOUT_USEC              (1000u)  /* 1ms SMIF init timeout */

#define GFX_TASK_NAME                       ( "CM55 Gfx Task" )
#define GFX_TASK_STACK_SIZE                 ( 20U * 1024U )
#define GFX_TASK_PRIORITY                   ( configMAX_PRIORITIES - 5 )

#define USB_WEBCAM_TASK_NAME                ( "CM55 USB Webcam Task")
#define USB_WEBCAM_TASK_STACK_SIZE          ( 20U * 1024U )
#define UART_CMD_TASK_STACK_SIZE            (512U)
#define USB_WEBCAM_TASK_PRIORITY            ( configMAX_PRIORITIES - 3 )

#define OOB_UART_TASK_PRIORITY              (2U)

/*******************************************************************************
* Global Variables
*******************************************************************************/
static mtb_serial_memory_t serial_memory_obj;
static cy_stc_smif_mem_context_t smif_mem_context;
static cy_stc_smif_mem_info_t smif_mem_info;
static mtb_hal_rtc_t rtc_obj;
mtb_hal_rtc_t         rtc;
static TaskHandle_t uart_cmd_thread;

void cm55_ns_gfx_task(void *arg);
void cm55_usb_webcam_task(void *arg);

/*******************************************************************************
* Functions
*******************************************************************************/

void vApplicationStackOverflowHook ( TaskHandle_t xTask, char *pcTaskName )
{
    CY_UNUSED_PARAMETER(xTask);
    CY_UNUSED_PARAMETER(pcTaskName);
    configASSERT(0);
}

void vApplicationMallocFailedHook ( void )
{
    configASSERT(0);
}


/*******************************************************************************
* Function Name: setup_clib_support
********************************************************************************
* Summary:
*    1. This function configures and initializes the Real-Time Clock (RTC).
*    2. It then initializes the RTC HAL object to enable CLIB support library
*       to work with the provided Real-Time Clock (RTC) module.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
static void setup_clib_support(void)
{
    /* RTC Initialization */
    if (CY_RTC_SUCCESS != Cy_RTC_Init(&CYBSP_RTC_config))
    {
        printf("[MAIN] RTC init failed\r\n");
        CY_ASSERT(0);
    }
    Cy_RTC_SetDateAndTime(&CYBSP_RTC_config);

    /* Initialize the ModusToolbox CLIB support library */
    mtb_clib_support_init(&rtc_obj);
}


/******************************************************************************
* Function Name: check_status
*******************************************************************************
* Summary:
*
*  Prints the message, indicates the non-zero status by turning the LED on, and
*  asserts the non-zero status.
*
* Parameters:
*
*  message:    Message to print if status is non-zero.
*  status:     Status for evaluation.
*
* Return:
*  void
*
******************************************************************************/
static void check_status(char *message, uint32_t status)
{
    if (status)
    {
        printf("\n\r====================================================\n\r");
        printf("\n\rFAIL: %s\n\r", message);
        printf("Error Code: 0x%x\n\r", (int) status);
        printf("\n\r====================================================\n\r");
    }
}


/*******************************************************************************
* Function Name: smif_ospi_psram_init
********************************************************************************
* Summary:
*  Initialize SMIF for PSRAM (QSPI Core 1) and set-up serial memory interfeace
*
* Parameters:
*  none
*
* Return:
*  void
*
*******************************************************************************/
static void smif_ospi_psram_init(void)
{
    cy_rslt_t result;

    /* Disable SMIF Block for reconfiguration. */
    Cy_SMIF_Disable(CYBSP_SMIF_CORE_1_PSRAM_HW);

    /* Initialize SMIF-1 Peripheral. */
    result = Cy_SMIF_Init((CYBSP_SMIF_CORE_1_PSRAM_hal_config.base),
                           (CYBSP_SMIF_CORE_1_PSRAM_hal_config.config),
                           SMIF_INIT_TIMEOUT_USEC, &smif_mem_context.smif_context);

    check_status("Cy_SMIF_Init failed", result);

    /* Configure Data Select Option for SMIF-1 */
    Cy_SMIF_SetDataSelect(CYBSP_SMIF_CORE_1_PSRAM_hal_config.base,
                          smif1BlockConfig.memConfig[0]->slaveSelect,
                          smif1BlockConfig.memConfig[0]->dataSelect);

    /* Enable the SMIF_CORE_1 block. */
    Cy_SMIF_Enable(CYBSP_SMIF_CORE_1_PSRAM_hal_config.base, &smif_mem_context.smif_context);

    /* Set-up serial memory. */
    result = mtb_serial_memory_setup(&serial_memory_obj,
                                MTB_SERIAL_MEMORY_CHIP_SELECT_2,
                                CYBSP_SMIF_CORE_1_PSRAM_hal_config.base,
                                CYBSP_SMIF_CORE_1_PSRAM_hal_config.clock,
                                &smif_mem_context,
                                &smif_mem_info,
                                &smif1BlockConfig);

    check_status("serial memory setup failed", result);
}


/*******************************************************************************
* Function Name: main
********************************************************************************
* Summary:
*  This is the main function for CM55 non-secure application.
*    1. It initializes the device and board peripherals.
*    2. It sets up the LPtimer instance for CM55 CPU and initializes debug UART.
*    3. It creates the FreeRTOS application task 'cm55_gfx_task'.
*    4. It starts the RTOS task scheduler.
*
* Parameters:
*  void
*
* Return:
*  int
*
*******************************************************************************/
int main(void)
{
    cy_rslt_t result;
    BaseType_t xReturned;
    static TaskHandle_t usb_webcam_handle;
    static TaskHandle_t gfx_task_handle;


    /* Initialize the device and board peripherals */
    result = cybsp_init();

    /* Board initialization failed. Stop program execution */
    if (CY_RSLT_SUCCESS != result)
    {
        handle_app_error();
    }

    /* Initialize retarget-io middleware */
    init_retarget_io();

    ifx_time_start();

    /* Initialize PSRAM and set-up serial memory */
    smif_ospi_psram_init();
    check_status("smif_ospi_psram_init error", (uint32_t)result);

    /* Enable XIP mode for the SMIF memory slot associated with the PSRAM. */
    result = mtb_serial_memory_enable_xip(&serial_memory_obj, true);
    check_status("mtb_serial_memory_enable_xip: failed", result);

    /* Enable write for the SMIF memory slot associated with the PSRAM. */
    result = mtb_serial_memory_set_write_enable(&serial_memory_obj, true);
    check_status("mtb_serial_memory_set_write_enable: failed", result);

    /* \x1b[2J\x1b[;H - ANSI ESC sequence for clear screen */
    printf("\x1b[2J\x1b[;H");

    printf("\r\n*************************************************************************************\r\n");
    printf("PSOC Edge MCU: Machine learning - face ID demo\r\n");
    printf("Build Version: %d.%d.%d\r\n", MAJOR_VERSION, MINOR_VERSION, PATCH_VERSION);
    printf("Build Date: %s\r\n", __DATE__);
    printf("Build Time: %s\r\n", __TIME__);
    printf("Following cameras are supported:\r\n");
    printf("1. HBVCAM OV7675 0.3MP Camera: https://www.hbvcamera.com/0-3mp-pixel-usb-cameras/hbvcam-ov7675-0.3mp-mini-laptop-camera-module.html\r\n");
    printf("2. Logitech C920 HD Pro Webcam: https://www.logitech.com/en-ch/shop/p/c920-pro-hd-webcam\r\n");
    printf("3. HBVCAM OS02F10 2MP Camera: https://www.hbvcamera.com/2-mega-pixel-usb-cameras/2mp-1080p-auto-focus-hd-usb-camera-module-for-atm-machine.html\r\n");
    printf("\r\n*************************************************************************************\r\n");

    /* Setup CLIB support library. */
    setup_clib_support();

    /* Enable global interrupts */
    __enable_irq();

    xReturned = xTaskCreate(cm55_ns_gfx_task, GFX_TASK_NAME,
                            GFX_TASK_STACK_SIZE ,
                            NULL, GFX_TASK_PRIORITY,
                            &gfx_task_handle);
    if (xReturned != pdPASS) {
        printf("[MAIN] Creating GFX task failed\n");
        CY_ASSERT(0);
    }

    xReturned = xTaskCreate(cm55_usb_webcam_task, USB_WEBCAM_TASK_NAME,
                            USB_WEBCAM_TASK_STACK_SIZE,
                            NULL, USB_WEBCAM_TASK_PRIORITY,
                            &usb_webcam_handle);
    if (xReturned != pdPASS) {
        printf("[MAIN] Creating usb webcam Task failed\n");
        CY_ASSERT(0);
    }

    xReturned =  xTaskCreate(OOB_UartCMD_Task, "UART_CMD",
                            UART_CMD_TASK_STACK_SIZE,
                            NULL, OOB_UART_TASK_PRIORITY,
                            &uart_cmd_thread);

        if (xReturned != pdPASS) {
            printf("[MAIN] Creating OOB Uart Task failed\n");
            CY_ASSERT(0);
        }

    /* Start the RTOS Scheduler */
    vTaskStartScheduler();

    /* Should never get here! */
    /* Halt the CPU if scheduler exits */
    printf("[MAIN] Halting demo\n");
    CY_ASSERT(0);

    return 0;

}

/* [] END OF FILE */
